Hi @enschilling 

Thanks for the today's call.
As suggested, I have removed the terraform and added version 1.5.7
Now the terraform plan list the plan, but fails with client error


➜  terraform-oci-arch-oke-mds git:(main) ✗ terraform --version
Terraform v1.5.7
on darwin_arm64
+ provider registry.terraform.io/hashicorp/cloudinit v2.3.2
+ provider registry.terraform.io/hashicorp/local v2.4.0
+ provider registry.terraform.io/hashicorp/oci v5.15.0
+ provider registry.terraform.io/hashicorp/random v3.5.1
+ provider registry.terraform.io/hashicorp/tls v4.0.4
+ provider registry.terraform.io/oracle/oci v5.15.0

Your version of Terraform is out of date! The latest version


➜  terraform-oci-arch-oke-mds git:(main) pwd
/Users/chendil/vcg/vcgoci/MDS/terraform-oci-arch-oke-mds
➜  terraform-oci-arch-oke-mds git:(main) rm -rf .terraform .terraform.lock.hcl 
➜  terraform-oci-arch-oke-mds git:(main) terraform init                       

Initializing the backend...
Initializing modules...
Downloading git::https://github.com/oracle-devrel/terraform-oci-cloudbricks-mysql-database.git?ref=v1.0.4.1 for mds-instance...
- mds-instance in .terraform/modules/mds-instance
Downloading git::https://github.com/oracle-devrel/terraform-oci-arch-oke.git for oci-oke...
- oci-oke in .terraform/modules/oci-oke
Downloading git::https://github.com/oracle-devrel/terraform-oci-arch-policies.git for policies...
- policies in .terraform/modules/policies
Downloading git::https://github.com/oracle-devrel/terraform-oci-arch-tags.git for policies.tags...
- policies.tags in .terraform/modules/policies.tags

Initializing provider plugins...
- Finding latest version of oracle/oci...
- Finding latest version of hashicorp/random...
- Finding latest version of hashicorp/oci...
- Finding latest version of hashicorp/local...
- Finding latest version of hashicorp/tls...
- Finding latest version of hashicorp/cloudinit...
- Installing hashicorp/cloudinit v2.3.2...
- Installed hashicorp/cloudinit v2.3.2 (signed by HashiCorp)
- Installing oracle/oci v5.15.0...
- Installed oracle/oci v5.15.0 (signed by a HashiCorp partner, key ID 1533A49284137CEB)
- Installing hashicorp/random v3.5.1...
- Installed hashicorp/random v3.5.1 (signed by HashiCorp)
- Installing hashicorp/oci v5.15.0...
- Installed hashicorp/oci v5.15.0 (signed by HashiCorp)
- Installing hashicorp/local v2.4.0...
- Installed hashicorp/local v2.4.0 (signed by HashiCorp)
- Installing hashicorp/tls v4.0.4...
- Installed hashicorp/tls v4.0.4 (signed by HashiCorp)

Partner and community providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://www.terraform.io/docs/cli/plugins/signing.html

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

╷
│ Warning: Additional provider information from registry
│ 
│ The remote registry returned warnings for registry.terraform.io/hashicorp/oci:
│ - For users on Terraform 0.13 or greater, this provider has moved to oracle/oci. Please update your source in
│ required_providers.
╵

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
➜  terraform-oci-arch-oke-mds git:(main) ✗ terraform plan                       
data.oci_identity_availability_domains.ADs: Reading...
data.oci_core_services.AllOCIServices: Reading...
data.oci_identity_region_subscriptions.home_region_subscriptions: Reading...
data.oci_core_images.BastionImageOCID: Reading...
data.oci_identity_region_subscriptions.home_region_subscriptions: Read complete after 0s [id=IdentityRegionSubscriptionsDataSource-3646932308]
data.oci_identity_availability_domains.ADs: Read complete after 0s [id=IdentityAvailabilityDomainsDataSource-3646932308]
data.oci_core_images.BastionImageOCID: Read complete after 0s [id=CoreImagesDataSource-2496560328]
data.oci_core_services.AllOCIServices: Read complete after 0s [id=CoreServicesDataSource-0]



 # module.policies.module.tags.random_id.tag_local will be created
  + resource "random_id" "tag_local" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 2
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

Plan: 23 to add, 0 to change, 0 to destroy.             <<<<

Changes to Outputs:
  + generated_ssh_private_key = (sensitive value)
  + mds_instance_ip           = (sensitive value)
╷
│ Error: Invalid provider configuration
│ 
│ Provider "registry.terraform.io/oracle/oci" requires explicit configuration. Add a provider block to the root module
│ and configure the provider's required arguments as described in the provider documentation.
│ 
╵
╷
│ Error: can not create client, bad configuration: did not find a proper configuration for tenancy
│ 
│   with provider["registry.terraform.io/oracle/oci"],
│   on <empty> line 0:
│   (source code not available)
│ 
╵
➜  terraform-oci-arch-oke-mds git:(main) ✗


if I add oracle/oci in provider.tf

terraform {
  required_version = ">= 1.1"
  required_providers {
    oci = {
      source = "oracle/oci"
    }
  }
}


Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + chosen_node_shape_and_image = {
      + image_id    = "ocid1.image.oc1.eu-frankfurt-1.aaaaaaaajrpl3xjz7uct44e36pjygsbkxfl7bejvkamxsdburdgn7ds5u7ma"
      + source_name = "Oracle-Linux-7.9-2023.08.31-0-OKE-1.27.2-642"
    }
  + generated_ssh_private_key   = (sensitive value)
╷
│ Error: Invalid provider configuration
│ 
│ Provider "registry.terraform.io/hashicorp/oci" requires explicit configuration. Add a provider block to the root
│ module and configure the provider's required arguments as described in the provider documentation.
│ 
╵
╷
│ Error: can not create client, bad configuration: did not find a proper configuration for tenancy
│ 
│   with provider["registry.terraform.io/hashicorp/oci"],
│   on <empty> line 0:
│   (source code not available)
│ 

somewhere it conflicts.